<a href="https://colab.research.google.com/github/ChitikelaAnitha123/Tasks/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

# Sample DataFrame
data = { 'Name': ['Anitha', 'chitikela', 'deepika', 'sangeetha', 'prema'], 'Age': [21, 30, 22, 28, 35], 'Gender': ['Female', 'Male', 'FeMale', 'FeMale', 'male'] }

df = pd.DataFrame(data)

# Filter rows where Age is greater than 25
filtered_df = df[df['Age'] > 25]
print(filtered_df)

df['City'] = ['New York', 'Los Angeles', 'Chicago', 'Miami', 'Seattle']
print(df)
#Aggregation and grouping
grouped_df = df.groupby('Gender').agg({'Age': 'mean'})
print(grouped_df)
# Sort the data by Age in ascending order
sorted_df = df.sort_values(by='Age')
print(sorted_df)
#Data transformation
df['Age'] = df['Age'].apply(lambda x: x + 5)
print(df)
#Reshaping data
pivot_df = df.pivot(index='Name', columns='Gender', values='Age')
print(pivot_df)

        Name  Age  Gender
1  chitikela   30    Male
3  sangeetha   28    Male
4      prema   35  Female
        Name  Age  Gender         City
0     Anitha   21  Female     New York
1  chitikela   30    Male  Los Angeles
2    deepika   22  FeMale      Chicago
3  sangeetha   28    Male        Miami
4      prema   35  Female      Seattle
         Age
Gender
FeMale  22.0
Female  28.0
Male    29.0
        Name  Age  Gender         City
0     Anitha   21  Female     New York
2    deepika   22  FeMale      Chicago
3  sangeetha   28    Male        Miami
1  chitikela   30    Male  Los Angeles
4      prema   35  Female      Seattle
        Name  Age  Gender         City
0     Anitha   26  Female     New York
1  chitikela   35    Male  Los Angeles
2    deepika   27  FeMale      Chicago
3  sangeetha   33    Male        Miami
4      prema   40  Female      Seattle
Gender     FeMale  Female  Male
Name
Anitha        NaN    26.0   NaN
chitikela     NaN     NaN  35.0
deepika      27.0     NaN   NaN
prema         NaN    40.0   NaN
sangeetha     NaN     NaN  33.0

In [ ]:
import pandas as pd



d = {

    'id': ['1', '2', '3', '4', '5'],

    'student_name': ['anitha', 'Karthik', 'Deepika', 'Tanu', 'Ravi']

}

df1 = pd.DataFrame(d, columns=['id', 'student_name'])

print(df1)

import pandas as pd



data = {

    'id': ['4', '5', '6', '7', '8'],

    'student_name': ['Elizebeth', 'Imarn', 'Cherry', 'Darani', 'Anu']

}

df2 = pd.DataFrame(data, columns=['id', 'student_name'])

print(df2)

pd.merge(df1, df2, on='id')
print(pd.concat([df1, df2]))

  id student_name
0  1       anitha
1  2      Karthik
2  3      Deepika
3  4         Tanu
4  5         Ravi
  id student_name
0  4    Elizebeth
1  5        Imarn
2  6       Cherry
3  7       Darani
4  8          Anu
  id student_name
0  1       anitha
1  2      Karthik
2  3      Deepika
3  4         Tanu
4  5         Ravi
0  4    Elizebeth
1  5        Imarn
2  6       Cherry
3  7       Darani
4  8          Anu

In [ ]:
#Handling Missing Data in Pandas



import pandas as pd

import numpy as np

df = pd.DataFrame.from_dict({

    'Name': ['Nithin', 'Karthik', 'Evan', 'Kiara', np.NaN],

    'Age': [33, 32, 40, 57, np.NaN],

    'Location': ['Toronto', 'London', 'New York', np.NaN, np.NaN]

})

print(df)

print(df.isnull())
print(df.isnull().sum())
df = df.fillna('NA')

print(df)



df = df.fillna({'Name': 'Someone', 'Age': 25, 'Location': 'USA'})

print(df)

      Name   Age  Location
0   Nithin  33.0   Toronto
1  Karthik  32.0    London
2     Evan  40.0  New York
3    Kiara  57.0       NaN
4      NaN   NaN       NaN
    Name    Age  Location
0  False  False     False
1  False  False     False
2  False  False     False
3  False  False      True
4   True   True      True
Name        1
Age         1
Location    2
dtype: int64
      Name   Age  Location
0   Nithin  33.0   Toronto
1  Karthik  32.0    London
2     Evan  40.0  New York
3    Kiara  57.0        NA
4       NA    NA        NA
      Name   Age  Location
0   Nithin  33.0   Toronto
1  Karthik  32.0    London
2     Evan  40.0  New York
3    Kiara  57.0        NA
4       NA    NA        NA

In [ ]:
#handling duplicates
import pandas as pd

df = pd.DataFrame.from_dict({

    'Name': ['Nik', 'Kate', 'Evan', 'Kyra', 'Nik', 'Kate'],

    'Age': [33, 32, 40, 57, 33, 32],

    'Location': ['Toronto', 'London', 'New York', 'Atlanta', 'Toronto', 'Paris'],

    'Date Modified': ['2022-01-01', '2022-02-24', '2022-08-12', '2022-09-12', '2022-01-01', '2022-12-09']

})



print(df)
print(df.duplicated())

print(df.duplicated().sum())

   Name  Age  Location Date Modified
0   Nik   33   Toronto    2022-01-01
1  Kate   32    London    2022-02-24
2  Evan   40  New York    2022-08-12
3  Kyra   57   Atlanta    2022-09-12
4   Nik   33   Toronto    2022-01-01
5  Kate   32     Paris    2022-12-09
0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool
1

In [ ]:
import pandas as pd



raw = {

    'Name': ['Darell', 'Darell', 'Lilith', 'Lilith', 'Tran', 'Tran', 'Tran',

        'Tran', 'John', 'Darell', 'Darell', 'Darell'],

    'Position': [2, 1, 1, 4, 2, 4, 3, 1, 3, 2, 4, 3],

    'Year': [2009, 2010, 2009, 2010, 2010, 2010, 2011, 2012, 2011, 2013, 2013, 2012],

    'Marks':[408, 398, 422, 376, 401, 380, 396, 388, 356, 402, 368, 378]

}

df = pd.DataFrame(raw)



group = df.groupby('Year')

print(group.get_group(2010))

     Name  Position  Year  Marks
1  Darell         1  2010    398
3  Lilith         4  2010    376
4    Tran         2  2010    401
5    Tran         4  2010    380
  subject_id student_name
0          1       anitha
1          2      Karthik
2          3      Deepika
3          4         Tanu
4          5         Ravi
0          4    Elizebeth
1          5        Imarn
2          6       Cherry
3          7       Darani
4          8          Anu